Repository: vdelachaux/UI-with-Classes
Catalog: test UI/Resources/*.lproj/HDI.xlf
Languages: fr

# desc_1
source: A very simple dialogue to request a password. - The dialog is displayed with a menu bar - The text box uses the font "%password" to hide the input. - The buttons are arranged according to their labels and may be inverted depending on the OS. - The validation button is only activated if a password is entered - Validation is only accepted if the password is correct (does not accept "1234" for the example)
fr: Un dialogue très simple pour demander un mot de passe. - La boîte de dialogue est affichée avec une barre de menu - Le champ de saisie utilise la police "%password" pour masquer la saisie. - Les boutons sont disposés en fonction de leurs étiquettes et peuvent être inversés selon le système d'exploitation. - Le bouton de validation n'est activé que si un mot de passe est saisi - La validation n'est acceptée que si le mot de passe est correct (n'accepte pas "1234" pour l'exemple)

# title_1
source: Simple dialog
fr: Un dialogue simple

# desc_2
source: This example shows how to use the menuBar and menu classes to - Define, install and manage a menu bar - Define, display and manage generic menus provided by the class (Fonts, Windows) - Define, display and manage contextual menus to suit your needs
fr: Cet exemple montre comment utiliser les classes menuBar et menu pour - Définir, installer et gérer une barre de menu - Définir, afficher et gérer des menus génériques fournis par la classe (Polices, Fenêtres) - Définir, afficher et gérer des menu contextuels selon vos besoins

# title_3
source: Position and size constraints
fr: Contraintes de position et de taille

# desc_3
source: You're familiar with the move and resize properties offered by the form editor for objects: Do nothing, move OR resize. Is that enough for you? Not for me. This dialog shows you how to use the "constraints" property of the "form" class to better manage the positioning and size of objects. - Move AND resize ;-) - Define a minimum or maximum width - Keep objects aligned to the right, left or centred - Apply complex constraints using formulas. In this dialog, the objects in red show the behaviour of the properties managed by 4D, the others are managed by the class.
fr: Vous connaissez les propriétés de déplacement et de redimensionnement offertes par l'éditeur de formulaire pour les objets : Ne rien faire, déplacer OU redimensionner. Hum, est-ce suffisant pour vous ? Pas pour moi. Ce dialogue vous montre comment utiliser la propriété "constraints" de la classe "form" pour mieux gérer le positionnement et la taille des objets. - Déplacer ET redimensionner ;-) - Définir une largeur minimum ou maximum - Garder des objets alignés à droite, à gauche ou bien centrés - Appliquer des contraintes complexes avec des formules. Dans ce dialogue, les objets en rouge montrent le comportement des propriétés gérées par 4D, les autres sont géré par la classe.

# desc_4
source: No code here 😱 Everything is done with CSS. Learn to adjust: - Title, style and text - Appearance and display - Default action - Input and text properties - and more And all this from the "class" property of course, but also simply from the name of a widget, its associated action or another property
fr: Pas de code ici 😱 Tout est fait avec les CSS. Apprenez à ajuster: - Titre, style et texte - Apparence et affichage - Action par défaut - Propriétés d'entrée et de texte - et plus Et tout cela à partir de la propriété "classe" bien sûr, mais aussi simplement à partir du nom d'un widget, de son action associée ou d'une autre propriété

# desc_5
source: This dialog shows how to use the search widget. This is a sub-form which displays a search box with icons adapted to the platform and which recalls the host form when the user modifies their input. Some options allow you to adjust the behaviour. You can define : - The placeholder text (default: none) - The shortcut (and any associated modifier) to activate the search box (default: Ctrl/Cmd "f") - The tooltip displayed by the widget (default: "⌘-f" on macOS & "⌃-f" on Windows) - The input type, which will define the correct input filter (default: text). - The instant mode, in which user keystrokes are sent to the host form as they are entered, or all at once when the widget loses focus (default: True = instant).
fr: Ce dialogue montre comment utiliser le widget de recherche. Il s'agit d'un sous-formulaire qui affiche une boîte de recherche avec des icônes adaptées à la plate-forme et qui rappelle le formulaire hôte lorsque l'utilisateur modifie sa saisie. Certaines options permettent d'ajuster le comportement. Vous pouvez définir : - Le texte d’exemple (par défaut : aucun) - Le raccourci (et éventuellement le modificateur associé) pour activer la boîte de recherche (par défaut : Ctrl/Cmd "f") - L'info-bulle affichée par le widget (par défaut : "⌘-f" sur macOS & "⌃-f" sur Windows) - Le type d'entrée qui définira le filtre d'entrée correct (par défaut : texte). - Le mode instantané, dans lequel les frappes de l'utilisateur sont envoyées au formulaire hôte au fur et à mesure de leur saisie, ou en une seule fois lorsque le widget perd le focus (par défaut : Vrai = instant).

# title_5
source: Search box
fr: Boîte de recherche

# title_6
source: Tab controls
fr: Onglets

# desc_6
source: This dialog shows a very simple implementation of tabs. - The data source for the top tabs is an object. Operation is fully managed by 4D with an automatic action. - The data source for the bottom tabs is a hierarchical list that can be used to display icons, which is not possible with an object. In this case, you must call the goToPage() function on click and don't forget to call the .clearList() function when the form is unloaded. - Note that the contructor of the tabControl class accepts a parameter to display a specific page at startup.
fr: Cette boîte de dialogue présente une implémentation très simple d'onglets. - La source de données pour les onglets du haut est un objet. Le fonctionnement est entièrement géré par 4D au moyen d'une action automatique. - La source de données pour les onglets du bas est une liste hiérarchique utilisée ici pour afficher des icônes, ce qui n'est pas possible avec un objet. Dans ce cas, il faut appeler la fonction goToPage() lors du clic et ne pas oublier d'appeler la fonction .clearList() lors du déchargement du formulaire. - Notez que le contructeur de la classe tabControl accepte un paramètre pour afficher une page spécifique au démarrage.

source: Select an example...
fr: Sélectionnez un exemple...

# run
source: Run the demo
fr: Exécuter la démo

source: Enter your password
fr: Saisissez votre mot de passe

source: Click here to validate your new password
fr: Cliquez ici pour valider votre nouveau mot de passe

source: The choice is yours:
fr: À vous de choisir :

source: Fonts
fr: Polices

source: Grouped by family
fr: Regroupées par famille

source: Show window…
fr: Afficher la fenêtre...

# addExtraMenuToTheMenuBar
source: Add the "Extra" menu to the menu bar
fr: Ajouter le menu "Extra" à la barre de menu

# removeExtraMenuFromTheMenuBar
source: Remove the "Extra" menu from the menu bar
fr: Supprimer le menu "Extra" de la barre de menu

source: Language…
fr: Langue…

source: English
fr: Anglais

# french
source: Français
fr: French

source: Settings…
fr: Paramètres…

source: Close
fr: Fermer

source: Window
fr: Fenêtre

# resizeMe
source: Resize me horizontally ->
fr: Redimensionnez-moi horizontalement ->

source: Cancel
fr: Annuler

# moreInformation
source: More informations…
fr: En savoir plus…
